docs/present/org-capture-presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-03-23 Sun 11:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="no-control" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/stylesheet.css" /> 
<meta http-equiv="cache-control" content="max-age=0, no-store, no-cache, must-revalidate, proxy-revalidate" />
<meta http-equiv="expires" content="0" />
<meta http-equiv="pragma" content="no-cache" />
</head>
<body>
<div id="preamble" class="status">
<div id="site-header">
   <h1>no-control-to-edit</h1>
   <div id="title-desc">Practicando español: Emacs, mi editor favorito</div>
<nav class="navbar">
<div class="navbar-container">
   <ul class="navbar-links">
   <li><a href="./index.html" class="navbar-link">Inicio</a>
   <li><a href="./about.html" class="navbar-link">Acerca De</a>
   </ul>
   </div>
</div>
</nav>
</div>
<div id="content" class="content">
<p>
#title: Org Capture Presentation<br />
</p>




<p>
emacs: 31.0.50<br />
os: Linux Mint Debian Edition 6.1<br />
fecha: 23 March 2025<br />
author: no-control-to-edit<br />
</p>
<div id="outline-container-orgf176449" class="outline-2">
<h2 id="orgf176449">Capturar una nota rápidamente</h2>
<div class="outline-text-2" id="text-orgf176449">
<p>
Esta libraria provee una manera de grabar una nota, con la mínima<br />
interrupción del flujo.<br />
</p>

<p>
Lo uso para notar cosas que me gustaría mejorar en emacs, cuando no<br />
puedo hacerlo en el momento.<br />
</p>
</div>
</div>
<div id="outline-container-org316f656" class="outline-2">
<h2 id="org316f656">Configurar una plantilla de captura (template)</h2>
<div class="outline-text-2" id="text-org316f656">
<p>
Para cada tipo de captura tienes que crear una plantilla que<br />
contiene la siguiente infomación.<br />
</p>

<ol class="org-ol">
<li>Una descripción de la plantilla<br /></li>
<li>Tipo de entrada<br />
'entry' crea un heading (titualar) de org-mode<br /></li>
<li>Datos usado para ubicar la entrada<br /></li>
<li>Cadena de formato por la entrada<br /></li>
</ol>

<p>
Manual de plantillas - Las varias opciones<br />
<a href="https://orgmode.org/manual/Template-elements.html">https://orgmode.org/manual/Template-elements.html</a><br />
</p>
</div>
</div>
<div id="outline-container-org5b9cffd" class="outline-2">
<h2 id="org5b9cffd">Ejemplo de una plantilla</h2>
<div class="outline-text-2" id="text-org5b9cffd">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #008000;">"Yak Shaving en Emacs"</span>
        entry
        (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
        <span style="color: #008000;">"* %?"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc0379e5" class="outline-2">
<h2 id="orgc0379e5">Asociar plantilla con una letra</h2>
<div class="outline-text-2" id="text-orgc0379e5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #008000;">"e"</span> . (<span style="color: #008000;">"Yak Shaving en Emacs"</span>
        entry
        (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
        <span style="color: #008000;">"* %?"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e00d57" class="outline-2">
<h2 id="org4e00d57">Ańadir la plantilla a la lista de plantillas</h2>
<div class="outline-text-2" id="text-org4e00d57">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">setq</span> org-capture-templates
        '((<span style="color: #008000;">"e"</span> . (<span style="color: #008000;">"Yak Shaving en Emacs"</span>
                  entry
                  (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
                  <span style="color: #008000;">"* %?"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org30b76d2" class="outline-2">
<h2 id="org30b76d2">Capture una nota</h2>
<div class="outline-text-2" id="text-org30b76d2">
<div class="org-src-container">
<pre class="src src-emacs-command">M-x org-capture
</pre>
</div>
</div>
</div>
<div id="outline-container-org3adafb5" class="outline-2">
<h2 id="org3adafb5">Visitar el archivo de notas por nombre del archivo</h2>
<div class="outline-text-2" id="text-org3adafb5">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(find-file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org50b5ac3" class="outline-2">
<h2 id="org50b5ac3">Visitar el archivo de notas por letra</h2>
<div class="outline-text-2" id="text-org50b5ac3">
<p>
Código elisp para ir al archivo asociado con una plantilla con la<br />
letra e<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(org-capture-goto-target <span style="color: #008000;">"e"</span>)
</pre>
</div>

<p>
nota: Cuando se usa funciones de org-capture, en vez de comandos, la<br />
libraría no se carga automáticamente. Tienes que hacerlo manualmente.<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">require</span> '<span style="color: #D0372D;">org-capture</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga13f93f" class="outline-2">
<h2 id="orga13f93f">Añadir un org capture por letra directamente</h2>
<div class="outline-text-2" id="text-orga13f93f">
<p>
Código elisp para activar org-capture por plantilla con letra e.<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">defun</span> <span style="color: #006699;">org-capture-e-ncte</span> ()
  <span style="color: #036A07;">"Captura de org por plantilla e"</span>
  (<span style="color: #0000FF; font-weight: bold;">interactive</span>)
  (org-capture nil <span style="color: #008000;">"e"</span>))
</pre>
</div>

<p>
Invocarlo directamente<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">M-x org-capture-e-ncte
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc84a0aa" class="outline-2">
<h2 id="orgc84a0aa">Añade un TODO al enacabezado</h2>
<div class="outline-text-2" id="text-orgc84a0aa">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">setq</span> org-capture-templates
        '((<span style="color: #008000;">"e"</span> . (<span style="color: #008000;">"Yak Shaving en Emacs"</span>
                  entry
                  (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
                  <span style="color: #008000;">"* TODO %?"</span>)))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org19bedfa" class="outline-2">
<h2 id="org19bedfa">Añade la fecha actual a la entrada</h2>
<div class="outline-text-2" id="text-org19bedfa">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">setq</span> org-capture-templates
        '((<span style="color: #008000;">"e"</span> . (<span style="color: #008000;">"Yak Shaving en Emacs"</span>
                  entry
                  (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
                  <span style="color: #008000;">"* TODO %? %u"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org7be6173" class="outline-2">
<h2 id="org7be6173">Añade la fecha en un cajón de propiedades</h2>
<div class="outline-text-2" id="text-org7be6173">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">setq</span> org-capture-templates
        '((<span style="color: #008000;">"e"</span> . (<span style="color: #008000;">"Yak Shaving en Emacs"</span>
                  entry
                  (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
                  <span style="color: #008000;">"* TODO %? \n:PROPERTIES:\n:CREATED: %u\n:END:"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org6056abe" class="outline-2">
<h2 id="org6056abe">Anteponer la entrada al inicio del archivo</h2>
<div class="outline-text-2" id="text-org6056abe">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">setq</span> org-capture-templates
        '((<span style="color: #008000;">"e"</span> . (<span style="color: #008000;">"Yak Shaving en Emacs"</span>
                entry
                (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
                <span style="color: #008000;">"* TODO %? \n:PROPERTIES:\n:CREATED: %u\n:END:"</span>
                <span style="color: #006FE0;">:prepend</span> t))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org812e600" class="outline-2">
<h2 id="org812e600">Abre org-mode con las entradas cerradas</h2>
<div class="outline-text-2" id="text-org812e600">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">setq</span> org-startup-folded t)
</pre>
</div>
</div>
</div>
<div id="outline-container-org687cdf0" class="outline-2">
<h2 id="org687cdf0">Copiar la region elegida a la captura</h2>
<div class="outline-text-2" id="text-org687cdf0">
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="color: #0000FF; font-weight: bold;">setq</span> org-capture-templates
        '((<span style="color: #008000;">"e"</span> . (<span style="color: #008000;">"Yak Shaving en Emacs"</span>
                entry
                (file <span style="color: #008000;">"~/tmp/yak-shaving.org"</span>)
                <span style="color: #008000;">"* TODO %? \n:PROPERTIES:\n:CREATED: %u\n:END:\n\n%i"</span>
                <span style="color: #006FE0;">:prepend</span> t))))
</pre>
</div>
</div>
</div>
<div id="outline-container-org99afca9" class="outline-2">
<h2 id="org99afca9">Ańade un enlace a la ubicación actual</h2>
<div class="outline-text-2" id="text-org99afca9">
<div class="org-src-container">
<pre class="src src-:results">%a
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="modified-at" class="content">
updated on
<span class="file_modified_date">23 03 2025</span>
at
<span class="file_modified_time">09:21:27</span>
.
</div>
</div>
</body>
</html>
